# Дано положительное действительное число X. Выведите его дробную часть
# n = float(input())

n = float(input())
print(round(n - int(n), 6))
