# Напишите программу, на вход которой подаётся прямоугольная матрица в виде 
# последовательности строк, заканчивающихся строкой, содержащей только строку 
#"end" (без кавычек)

# Программа должна вывести матрицу того же размера, у которой каждый элемент в
# позиции i, j равен сумме элементов первой матрицы на позициях
# (i-1, j), (i+1, j), (i, j-1), (i, j+1). У крайних символов соседний элемент
# находится с противоположной стороны матрицы.

# В случае одной строки/столбца элемент сам себе является соседом
# по соответствующему направлению.
# a = [[0] * n for i in range(n)]
# n = 5
# a = [[0 for j in range(n)] for i in range(n)]
# for i in range(n):
# 	for j in range(n):
#		print (a[i][j], end = '')
#	print(a[i][j])
#Кейс 1 с текущей страницы:
#Вход - 1
#Выход - 4

#Кейс 2:
#Вход - 15 -4 8 3
#Выход - 29 15 15 29

#Кейс 3:
#Вход - 
#0
#7
#9
#12
#Выход -
#19
#23
#37
#33

#Кейс 4:
#Вход -
#2 2 2 3 0 5
#8 -4 3 5 1 0
#Выход -
#23 -4 11 12 10 2
#0 15 5 10 5 19

#Кейс 5:
#Вход -
#2 2
#3 5
#-1 7
#0 1
#Выход -
#7 10
#11 15
#17 4
#3 9

import copy
#a = [[9,5,3], [0,7,-1], [-5,2,9]]
#print ('Исходная матрица:')
line = []
k = 0
a = []
c = []
while True:
	k = input()#тестируем конфликт
	if k == 'end':
		break
	line = [int(i) for i in k.split()]
#	print(type(line),line)
	a.append(line)

b = copy.deepcopy(a)
# = a
for i in range(len(a)):
	for j in range(len(a[i])):
		if len(a[i]) == 1:
			b[i][j] = a[i][j]*4
		elif len(a) == 1 and j == len(a[i])-1:
			b[i][j] = a[i][0] + a[i][j-1] + a[i][j]*2
		elif len(a) == 1:
			b[i][j] = a[i][j]*2 + a[i][j-1] + a[i][j+1]	
		else:
			if i == len(a)-1 and j == len(a[i])-1:
				b[i][j] = a[i][j-1] + a[i][0] + a[i-1][j] + a[0][j]
				#print()
			elif j == len(a[i])-1:
				b[i][j] = a[i-1][j] + a[i+1][j] + a[i][j-1] + a[i][0]
				#print('сработало 2')
			elif i == len(a)-1:
				b[i][j] = a[i-1][j] + a[0][j] + a[i][j-1] + a[i][j+1]
				#print('сработало 3')
			else:
				#print('сработало 4')
				#print(a[i][j-1],'+',a[i][j+1],'+',a[i-1][j],'+',a[i+1][j],'=',
				#	a[i][j-1] + a[i][j+1] + a[i-1][j] + a[i+1][j])
				b[i][j] = a[i][j-1] + a[i][j+1] + a[i-1][j] + a[i+1][j]
				#print ('i=',i,'j=',j, 'a[i][j-1]=',a[i][j-1])

#		b[i][j] = a[i][j]+1
for i in range(len(b)):
	for j in range(len(b[i])):
		print (b[i][j], ' ', end = '')
	print ()
